Revit 2024 API
ISaveSharedCoordinatesCallbackForUnloadLocally.GetSaveModifiedLinksOptionForUnloadLocally Method
 Determines whether Revit should save the link or not prior to unloading the link locally.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
SaveModifiedLinksOptionsForUnloadLocally GetSaveModifiedLinksOptionForUnloadLocally(
	RevitLinkType link
)
Visual Basic
Function GetSaveModifiedLinksOptionForUnloadLocally ( _
	link As RevitLinkType _
) As SaveModifiedLinksOptionsForUnloadLocally
Visual C++
SaveModifiedLinksOptionsForUnloadLocally GetSaveModifiedLinksOptionForUnloadLocally(
	RevitLinkType^ link
)
Parameters
link
Type: Autodesk.Revit.DB.RevitLinkType
 The Revit link which has modified shared coordinates.
Return Value
 The saving option when unloading locally a linked file which has been modified in-memory by shared coordinates operations.
See Also
ISaveSharedCoordinatesCallbackForUnloadLocally Interface
Autodesk.Revit.DB Namespace